In [1]:
# import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [27]:
# This command tells python to remember a main folder path_Original Data
path_1= r'/Users/obinwannealisigwe/Desktop/Python/Achievement_4_Project_Obi/02. Data/Original Data'

In [58]:
# This command tells python to remember a main folder path_Prepared Data
path = r'/Users/obinwannealisigwe/Desktop/Python/Achievement_4_Project_Obi/02. Data/Prepared Data'

In [30]:
# Importing the 'new customer data' file into the Jupyter 
customers = pd.read_csv(os.path.join(path_1, 'customers.csv'))

In [32]:
# Check the customer.csv data
customers.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [33]:
# Checking the data dimension
customers.shape

(206209, 10)

In [34]:
# Check the descriptive analysis
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [35]:
# Checking the data types
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

## 4. Wrangle data to follow the consistency logic

In [36]:
# Renaming columns to make it uniform
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [37]:
customers.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [38]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [39]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [40]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [41]:
customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [42]:
# Check the updated columns
customers.columns

Index(['user_id', 'first_name', 'surname', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'marital_status', 'income'],
      dtype='object')

#### The columns have been changed

In [43]:
customers.head(7)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746

## 5. Complete the fundamental data quality and consistency checks

In [48]:
# Check the mixed data-types in each column
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

In [49]:
# the above confirmed the output reveal that the first_name has mixed data_type
customers['first_name'] = customers['first_name'].astype('str')

In [51]:
# user_id is not listed correctly as an integer
customers['user_id'] = customers['user_id'].astype('str')

In [52]:
# Checking the data types again
customers.dtypes

user_id           object
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [53]:
# Confirmation
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

#### Confirmation that we don't have mixed data types in this current customer data

In [54]:
# To prove it!
customers.isnull().sum()

user_id           0
first_name        0
surname           0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

In [55]:
# We check for duplicates
customers_dups = customers[customers.duplicated()]

In [56]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

In [57]:
# reconfirm using descriptive statistics
customers.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

#### Quality and consistency confirmed

## 6. Combine your customer data with the rest of your prepared Instacart data.

In [59]:
# Importing the 'df_merged' file into the Jupyter 
df_ord_prod_merge_grouped_visual = pd.read_pickle(os.path.join(path, 'orders_products_combined_groupedby_merged_derived.pkl'))

In [60]:
# To check the shape of the imported df
df_ord_prod_merge_grouped_visual.shape

(32404859, 23)

In [61]:
# Check the shape of the customer df again
customers.shape

(206209, 10)

In [62]:
# Confirmed a shared colum
df_ord_prod_merge_grouped_visual.head(7)

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,_merge,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_product_price,spending_flag,median_days_behaviour_orders,order_frequency
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,both,Regularly busy,Regularly busy,Most orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,both,Regularly busy,Regularly busy,Most orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,both,Busiest day,Busiest days,Average orders,5,New customer,7.930208,Low spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,both,Regularly busy,Slowest days,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,both,Least busy,Slowest days,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent customer
5,1,Chocolate Sandwich Cookies,61,19,5.8,1701441,777,16,1,7,...,both,Regularly busy,Busiest days,Average orders,26,Regular customer,6.935398,Low spender,11.0,Regular customer
6,1,Chocolate Sandwich Cookies,61,19,5.8,1871483,825,3,2,14,...,both,Regularly busy,Regularly busy,Most orders,9,New customer,5.957576,Low spender,20.0,Regular customer

In [63]:
customers.head(7)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746

#### They both have user_id column

In [65]:
# To check the data of the shared column
df_ord_prod_merge_grouped_visual.dtypes['user_id']

dtype('int64')

In [67]:
customers.dtypes['user_id']

dtype('O')

In [68]:
# To make sure that the both users are the same data type
df_ord_prod_merge_grouped_visual['user_id'] = df_ord_prod_merge_grouped_visual['user_id'].astype('str')

In [69]:
df_ord_prod_merge_grouped_visual.dtypes['user_id']

dtype('O')

#### The above confirm that the key columns have matching data-types

In [70]:
# drop '_merge column
df_ord_prod_merge_grouped_visual = df_ord_prod_merge_grouped_visual.drop(columns=['_merge'])

In [71]:
cust_ord_prod = df_ord_prod_merge_grouped_visual.merge(customers, on = 'user_id', indicator = True)

#### We can confirm that we have combined the customers and orders_products dataframes using the 'user_id' as the default join (inner)

In [72]:
# To check the newly merged dataframe
cust_ord_prod.shape

(32404859, 32)

In [73]:
cust_ord_prod.head(5)

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302,both
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both

In [74]:
# To check the value counts of the inner join
cust_ord_prod['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [75]:
cust_ord_prod.dtypes

product_id                         int64
product_name                      object
aisle_id                           int64
department_id                      int64
prices                           float64
order_id                           int64
user_id                           object
order_number                       int64
orders_day_of_week                 int64
order_hour_of_day                  int64
days_since_prior_order           float64
add_to_cart_order                  int64
reordered                          int64
busiest_day                       object
busiest_days                      object
busiest_period_of_day             object
max_order                          int64
loyalty_flag                      object
mean_product_price               float64
spending_flag                     object
median_days_behaviour_orders     float64
order_frequency                   object
first_name                        object
surname                           object
gender                            object
state                             object
age                                int64
date_joined                       object
n_dependants                       int64
marital_status                    object
income                             int64
_merge                          category
dtype: object

In [76]:
# the order_id column shows an int64, we will change it to object
cust_ord_prod['order_id'] = cust_ord_prod['order_id']. astype('str')

In [77]:
cust_ord_prod.dtypes

product_id                         int64
product_name                      object
aisle_id                           int64
department_id                      int64
prices                           float64
order_id                          object
user_id                           object
order_number                       int64
orders_day_of_week                 int64
order_hour_of_day                  int64
days_since_prior_order           float64
add_to_cart_order                  int64
reordered                          int64
busiest_day                       object
busiest_days                      object
busiest_period_of_day             object
max_order                          int64
loyalty_flag                      object
mean_product_price               float64
spending_flag                     object
median_days_behaviour_orders     float64
order_frequency                   object
first_name                        object
surname                           object
gender                            object
state                             object
age                                int64
date_joined                       object
n_dependants                       int64
marital_status                    object
income                             int64
_merge                          category
dtype: object

## Export this new dataframe as a pickle file

In [78]:
# Export data "pkl"
cust_ord_prod.to_pickle(os.path.join(path,'orders_products_customer_merged.pkl'))